-- HW-4
/* 1.Ранжируйте продукты (по ProductRank) в каждой 
категории на основе их общего объема продаж 
(TotalSales). */

/* 2. Обратимся к таблице Clusters
Рассчитайте среднюю сумму кредита (AvgCreditAmount) 
для каждого кластера и месяца, учитывая общую среднюю 
сумму кредита за соответствующий месяц 
(OverallAvgCreditAmount).
Определите OverallAvgCreditAmount в первой строке 
результатов запроса. */

/* 3.Сопоставьте совокупную сумму сумм кредита 
(CumulativeSum) для каждого кластера, упорядоченную 
по месяцам, и сумму кредита в порядке возрастания.
Определите CumulativeSum в первой строке результатов 
запроса. */