-- HomeWork-5
/* 1} Создайте хранимую процедуру с именем 
«GetEmployeeOrders». который принимает идентификатор 
сотрудника в качестве параметра и возвращает все заказы, 
обработанные этим сотрудником.
Пропишите запрос, который создаст требуемую процедуру. */

/* 2} Создайте таблицу EmployeeRoles, как на уроке и 
удалите ее.
Напишите запрос, который удалит нужную таблицу. */

/* 3}  Удалите все заказы со статусом 'Delivered' из 
таблицы OrderStatus, которую создавали на семинаре
Напишите запрос, который удалит нужные строки в таблице. */
